# Необхідно розробити функцію, яка приймає рядок як вхідний параметр,
# додає всі його символи до двосторонньої черги (deque з модуля collections в Python),
# а потім порівнює символи з обох кінців черги, щоб визначити, чи є рядок паліндромом.
# Програма повинна правильно враховувати як рядки з парною, так і з непарною кількістю
# символів, а також бути нечутливою до регістру та пробілів.

from collections import deque


def is_palindrome(input_string):
    normalized_string = "".join(input_string.lower().split())
    char_deque = deque(normalized_string)

    while len(char_deque) > 1:
        if char_deque.popleft() != char_deque.pop():
            return False

    return True


test_strings = [
    "радар",  # Простий паліндром з непарною кількістю символів.
    "топот",  # Паліндром з парною кількістю символів.
    "А роза упала на лапу Азора",  # Відомий паліндром з пробілами та різними регістрами.
    "Я несу гусеня",  # Паліндром з пробілами.
    "Привіт",  # Не є паліндромом.
    "Де помити мопед",  # Паліндром з пробілами та нечутливий до регістру.
    "Мадам",  # Паліндром з різним регістром літер.
    "",  # Порожній рядок, крайовий випадок.
    " ",  # Рядок з одним пробілом.
    "12321",  # Числовий паліндром.
    "12345",  # Числовий не паліндром.
    "😊😊",  # Паліндром зі смайликами.
    "😊абв😊",  # Не паліндром зі смайликами.
    "абввба",  # Паліндром з парною кількістю символів.
    "абвга",  # Не є паліндромом.
]

for test in test_strings:
    print(f"Чи поліндром '{test}'? {is_palindrome(test)}")
